In [ ]:
Q1. List any five functions of the pandas library with execution.

In [ ]:
read_csv(): 
    This function is used to read data from a CSV file and create a pandas DataFrame.
    
head(): 
    This function displays the first few rows of a DataFrame. By default, it shows the first 5 rows.
    
info(): 
    This function provides a summary of the DataFrame, including the column names, data types, and number of non-null values.
    
groupby(): 
    This function is used to group data in a DataFrame based on one or more columns, allowing for further analysis or aggregation.

to_csv(): This function is used to write the contents of a DataFrame to a CSV file.

In [2]:
import pandas as pd

# Read CSV file
data = pd.read_csv('titanic.csv')
print(data)

     PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]

In [3]:
# Create a DataFrame
data = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                     'B': ['a', 'b', 'c', 'd', 'e']})

# Display the first 3 rows
print(data.head(3))

   A  B
0  1  a
1  2  b
2  3  c

In [4]:
# Create a DataFrame
data = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                     'B': ['a', 'b', 'c', 'd', 'e']})

# Get DataFrame information
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       5 non-null      int64
 1   B       5 non-null      object
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

In [5]:
# Create a DataFrame
data = pd.DataFrame({'A': ['apple', 'banana', 'apple', 'banana', 'apple'],
                     'B': ['red', 'yellow', 'green', 'yellow', 'green'],
                     'C': [1, 2, 3, 4, 5]})

# Group data by column 'A' and calculate the sum of column 'C'
grouped_data = data.groupby('A')['C'].sum()
print(grouped_data)

A
apple     9
banana    6
Name: C, dtype: int64

In [6]:

# Create a DataFrame
data = pd.DataFrame({'A': [1, 2, 3, 4, 5],
                     'B': ['a', 'b', 'c', 'd', 'e']})

# Write DataFrame to a CSV file
data.to_csv('output.csv', index=False)

In [ ]:
Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the
DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
def reindex_with_increment(df):
    # Reset the index with a new index starting from 1 and incrementing by 2
    new_index = pd.RangeIndex(start=1, stop=len(df) * 2, step=2)
    df = df.reset_index(drop=True)
    df.index = new_index
    return df

# Example usage
df= pd.DataFrame({'A': ['apple', 'banana', 'apple', 'banana', 'apple'],
                     'B': ['red', 'yellow', 'green', 'yellow', 'green'],
                     'C': [1, 2, 3, 4, 5]})

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Reindex the DataFrame
df_reindexed = reindex_with_increment(df)

# Display the reindexed DataFrame
print("\nReindexed DataFrame:")
print(df_reindexed)

Original DataFrame:
        A       B  C
0   apple     red  1
1  banana  yellow  2
2   apple   green  3
3  banana  yellow  4
4   apple   green  5

Reindexed DataFrame:
        A       B  C
1   apple     red  1
3  banana  yellow  2
5   apple   green  3
7  banana  yellow  4
9   apple   green  5

In [ ]:
Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that
iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The
function should print the sum to the console.

In [18]:
def sumOfVal(df):
    first_three_values = df['Values'].head(3)
    sum_of_values = first_three_values.sum()
    print("Sum of the first three values:", sum_of_values)

df=pd.DataFrame({'Values':[10, 20, 30, 40, 50]})
sumOfVal(df)

Sum of the first three values: 60

In [ ]:
Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column
'Word_Count' that contains the number of words in each row of the 'Text' column.

In [4]:
import pandas as pd

def count_words(df):
    # Function to count words in a given text
    def word_count(text):
        return len(text.split())

    # Apply the word_count function to each row in the 'Text' column
    df['Word_Count'] = df['Text'].apply(word_count)

    return df

# Example usage
df=pd.DataFrame({'Text':['Hello All','Welcome to Python Programming', 'with Pandas.','This', 'is', 'Example of word count function']})

# Display the original DataFrame
print("Original DataFrame:")
print(df)

# Count words and create the 'Word_Count' column
df_with_word_count = count_words(df)

# Display the DataFrame with the new 'Word_Count' column
print("\nDataFrame with Word_Count:")
print(df_with_word_count)

Original DataFrame:
                             Text
0                       Hello All
1   Welcome to Python Programming
2                    with Pandas.
3                            This
4                              is
5  Example of word count function

DataFrame with Word_Count:
                             Text  Word_Count
0                       Hello All           2
1   Welcome to Python Programming           4
2                    with Pandas.           2
3                            This           1
4                              is           1
5  Example of word count function           5

In [ ]:
Q5. How are DataFrame.size() and DataFrame.shape() different?

In [ ]:
The DataFrame.size and DataFrame.shape are two different attributes in pandas that provide information about the size and shape of a DataFrame. 
Here is how they differ:

DataFrame.size:
    DataFrame.size returns the total number of elements in a DataFrame, which is the product of the number of rows and columns.
    It represents the total size of the DataFrame, including all the individual elements.
    The returned value is an integer.
    It can be obtained by calling the size attribute on a DataFrame object.
    
DataFrame.shape:
    DataFrame.shape returns a tuple containing the dimensions of a DataFrame, i.e., the number of rows and columns.
    It represents the structure or shape of the DataFrame.
    The returned value is a tuple in the format (number_of_rows, number_of_columns).
    It can be obtained by calling the shape attribute on a DataFrame object.
    
In summary, DataFrame.size provides the total number of elements in a DataFrame, while DataFrame.shape provides the dimensions 
(number of rows and columns) of the DataFrame.

In [12]:
import pandas as pd
df= pd.DataFrame({'A': ['apple', 'banana', 'apple', 'banana', 'apple'],
                     'B': ['red', 'yellow', 'green', 'yellow', 'green'],
                     'C': [1, 2, 3, 4, 5]})

print(df.size)
print(df.shape)

15
(5, 3)

In [ ]:
Q6. Which function of pandas do we use to read an excel file?

In [ ]:
In pandas, you can use the 'read_excel()' function to read data from an Excel file. This function allows you to read data from 
a specific sheet or multiple sheets within an Excel file. Here is an example of how to use the read_excel() function:

In [13]:
# Read data from an Excel file
data = pd.read_excel('Train.xlsx', sheet_name='Sheet1')

# Display the DataFrame
print(data)

    EmpID    EmpName LanguageOfCommunication  Age  Gender  \
0   11041       John                 English   35    Male
1   15079    William                 English   26    Male
2   18638      James                 English   36  Female
3    3941    Charles                 English   29  Female
4    5936     George                 English   25    Male
5    9670      Frank                  Native   35    Male
6   16554     Joseph                   Hindi   31    Male
7    3301     Thomas                 English   32    Male
8   12236      Henry                 English   28  Female
9   10157     Robert                  Native   31  Female
10  24117     Edward                   Hindi   29    Male
11  21889      Harry                 English   28    Male
12  12056     Walter                 English   30    Male
13  23265     Arthur                   Hindi   27    Male
14   2176       Fred                  Native   35    Male
15  23332     Albert                 English   30    Male
16   2642     Samuel                  Native   28  Female
17   7826      David                 English   34    Male
18  10875      Louis                   Hindi   32  Female
19   6491        Joe                 English   30  Female
20   9960    Charlie                 English   25    Male
21   3082   Clarence                   Hindi   26    Male
22  20039    Richard                  Native   34    Male
23   5558     Andrew                  Native   36    Male
24   7191     Daniel                 English   30  Female
25  18467     Ernest                 English   35  Female
26  13540       Will                 English   32  Female
27  16784      Jesse                   Hindi   28    Male
28  14685      Oscar                 English   29  Female
29   5014      Lewis                 English   27    Male
30  19915      Peter                   Hindi   34    Male
31   3097   Benjamin                   Hindi   36  Female
32   9974  Frederick                   Hindi   27    Male
33   8216     Willie                 English   32    Male
34   2454     Alfred                 English   33    Male
35  22952        Sam                 English   29    Male
36   4468        Roy                 English   30    Male
37  18131    Herbert                   Hindi   34    Male
38  20203      Jacob                 English   27    Male
39  19363        Tom                 English   32    Male
40   9324      Elmer                 English   35    Male
41   4226       Carl                 English   35    Male
42   9236        Lee                 English   28    Male
43   3200     Howard                 English   29    Male
44  18516     Martin                   Hindi   30    Male
45   5825    Michael                 English   29    Male
46   6772       Bert                   Hindi   28  Female
47   5758     Herman                 English   35    Male
48   2013        Jim                   Hindi   24    Male
49  20754    Francis                 English   35   Other

   JobProfileIDApplyingFor HighestDegree                DegreeBranch  \
0                  JR85289        B.Tech                  Electrical
1                  JR87525        B.Tech     Artificial Intelligence
2                  JR87525           PhD            Computer Science
3                  JR87525           BCA      Information Technology
4                  JR70175   Dual M.Tech            Computer Science
5                  JR88879           BCA            Computer Science
6                  JR85289           PhD            Computer Science
7                  JR85289        B.Tech      Information Technology
8                  JR87525        M.Tech                  Electrical
9                  JR88873        B.Tech     Artificial Intelligence
10                 JR85289        B.Tech     Artificial Intelligence
11                 JR87525        B.Tech                  Electrical
12                 JR85289        M.Tech            Computer Science
13                 JR85289        B.Tech            Computer Science
14                 JR85289        B.Tech                 Electronics
15                 JR85289        B.Tech      Information Technology
16                 JR89890        B.Tech  Electrical and Electronics
17                 JR81165        M.Tech                  Electrical
18                 JR85289        B.Tech                  Electrical
19                 JR87525           BCA            Computer Science
20                 JR88873        B.Tech            Computer Science
21                 JR87525        B.Tech      Information Technology
22                 JR87525        B.Tech                 Electronics
23                 JR88873        M.Tech     Artificial Intelligence
24                 JR87525   Dual M.Tech            Computer Science
25                 JR87525            MS            Computer Science
26                 JR70175        B.Tech                 Electronics
27                 JR88873        B.Tech            Computer Science
28                 JR85289           BCA            Computer Science
29                 JR85289           BCA            Computer Science
30                 JR85289   Dual M.Tech      Information Technology
31                 JR85289        M.Tech                  Electrical
32                 JR85289        B.Tech  Electrical and Electronics
33                 JR88873      Dual MBA      Information Technology
34                 JR89890            MS                 Electronics
35                 JR85289   Dual M.Tech            Computer Science
36                 JR88879           BCA                 Electronics
37                 JR85289           BCA     Artificial Intelligence
38                 JR88873        B.Tech                  Electrical
39                 JR85289        B.Tech                  Electrical
40                 JR87525        B.Tech            Computer Science
41                 JR88873        B.Tech                  Electrical
42                 JR89890           BCA      Information Technology
43                 JR85289            MS            Computer Science
44                 JR85289   Dual M.Tech                 Electronics
45                 JR89890        M.Tech      Information Technology
46                 JR88879           BCA     Artificial Intelligence
47                 JR88879   Dual M.Tech                 Electronics
48                 JR85289           BCA      Information Technology
49                 JR85289      Dual MBA            Computer Science

   GraduatingInstitute  LatestDegreeCGPA  ...  CurrentCTC  ExpectedCTC  \
0               Tier 1                 7  ...          21           26
1               Tier 3                 7  ...          15           19
2               Tier 1                 6  ...          15           24
3               Tier 2                 5  ...          16           24
4               Tier 3                 8  ...          24           32
5               Tier 2                 9  ...          25           29
6               Tier 1                 7  ...          12           21
7               Tier 2                 8  ...           7           17
8               Tier 1                 6  ...          21           28
9               Tier 2                 8  ...          21           31
10              Tier 1                 7  ...           9           16
11              Tier 3                 6  ...          25           31
12              Tier 2                 7  ...          12           16
13              Tier 1                 5  ...          17           26
14              Tier 1                 8  ...          23           33
15              Tier 1                 5  ...          22           27
16              Tier 2                 5  ...          18           26
17              Tier 2                 7  ...          12           18
18              Tier 2                 7  ...           8           18
19              Tier 1                 8  ...          20           24
20              Tier 1                 6  ...          15           19
21              Tier 1                 7  ...          23           29
22              Tier 1                 7  ...           9           15
23              Tier 1                 6  ...          15           24
24              Tier 2                 6  ...           7           15
25              Tier 1                 8  ...          17           22
26              Tier 2                 8  ...          19           24
27              Tier 2                 9  ...          28           37
28              Tier 1                 8  ...          11           17
29              Tier 1                 7  ...          26           31
30              Tier 1                 8  ...          17           23
31              Tier 2                 4  ...          27           35
32              Tier 1                 7  ...          15           25
33              Tier 3                 8  ...          17           24
34              Tier 2                 5  ...           6           13
35              Tier 3                10  ...          20           29
36              Tier 1                 7  ...          11           21
37              Tier 2                 8  ...          16           24
38              Tier 3                 6  ...           9           15
39              Tier 2                 7  ...          14           20
40              Tier 2                 7  ...          28           33
41              Tier 1                 8  ...          18           24
42              Tier 1                 6  ...          10           14
43              Tier 3                 8  ...          19           23
44              Tier 1                 7  ...          28           33
45              Tier 1                 8  ...          25           32
46              Tier 2                 9  ...          28           36
47              Tier 2                 7  ...          17           23
48              Tier 2                 9  ...           9           14
49              Tier 3                 7  ...          25           35

    MartialStatus  EmpScore CurrentDesignation  CurrentCompanyType  \
0         Married         5                SSE          Enterprise
1         Married         5                 BA            MidSized
2          Single         5                SDE            MidSized
3         Married         5                SDE             Startup
4         Married         5                SDE          Enterprise
5         Married         4                 DS            MidSized
6          Single         3                SDE          Enterprise
7         Married         3                SSE            MidSized
8         Married         4                SDE             Startup
9         Married         3                SDE             Startup
10        Married         3                 EM          Enterprise
11        Married         3                SSE             Startup
12         Single         4                SSE          Enterprise
13        Married         2                 EM          Enterprise
14        Married         4                SDE            MidSized
15        Married         4                SSE            MidSized
16        Married         4                 EM             Startup
17        Married         5                SSE          Enterprise
18         Single         3                 EM             Startup
19         Single         4                SSE             Startup
20        Married         4                 DS             Startup
21        Married         4                SDE             Startup
22        Married         3                SSE          Enterprise
23        Married         2                SDE             Startup
24        Married         4                SDE            MidSized
25        Married         4                SDE             Startup
26         Single         5                 BA             Startup
27        Married         4                SSE            MidSized
28        Married         2                 DA          Enterprise
29         Single         4                SDE          Enterprise
30        Married         4                SSE            MidSized
31        Married         3                 DS          Enterprise
32         Single         3                SDE          Enterprise
33         Single         4                 BA             Startup
34        Married         1                SDE             Startup
35         Single         4                SDE             Startup
36         Single         3                SDE             Startup
37        Married         3                 BA          Enterprise
38        Married         4                SDE             Startup
39         Single         3                 DS            MidSized
40        Married         3                SSE             Startup
41         Single         4                SDE             Startup
42        Married         3                 EM            MidSized
43         Single         3                SSE             Startup
44         Single         4                SDE          Enterprise
45        Married         4                SDE             Startup
46         Single         2                 BA             Startup
47        Married         2                 BA             Startup
48        Married         4                 DS            MidSized
49        Married         4                 EM             Startup

   DepartmentInCompany TotalLeavesTaken BiasInfluentialFactor  FitmentPercent
0               Design               20      YearsOfExperince           95.40
1          Engineering                6                   NaN           67.09
2          Engineering               19                Gender           91.26
3              Product               16                Gender           72.29
4          Engineering               10          DegreeBranch           86.34
5          Engineering               10      YearsOfExperince           93.23
6     Customer Success                8    CurrentCompanyType           62.29
7          Engineering               18          DegreeBranch           93.71
8          Engineering                7                Gender           91.66
9     Customer Success               10                Gender           73.31
10             Finance                6                   NaN           56.85
11         Engineering                7         MartialStatus           75.07
12              Design                5    CurrentCompanyType           60.85
13         Engineering               20                   NaN           41.99
14         Engineering                7      YearsOfExperince           92.11
15         Engineering               12          DegreeBranch           87.37
16         Engineering               19                Gender           80.63
17              Design               16                   NaN           38.68
18         Engineering                5                Gender           79.68
19         Engineering                9                Gender           84.60
20              Design                8          DegreeBranch           90.59
21             Product               14          DegreeBranch           85.70
22             Finance               18                   NaN           34.14
23         Engineering               11      YearsOfExperince           86.29
24         Engineering                9                Gender           93.42
25         Engineering               20                Gender           84.80
26         Engineering               15                Gender           84.32
27              Design               14          DegreeBranch           88.88
28             Finance                9    CurrentCompanyType           69.90
29              Design                6          DegreeBranch           92.52
30             Finance               19      YearsOfExperince           93.68
31         Engineering               12                Gender           84.99
32         Engineering               13    CurrentCompanyType           67.37
33              Design               19          DegreeBranch           84.83
34    Customer Success                6         HighestDegree           77.18
35             Product               11          DegreeBranch           89.22
36         Engineering               20                   NaN           94.18
37         Engineering                7                   NaN           49.54
38              Design               20              EmpScore           73.20
39         Engineering                4                   NaN           69.48
40         Engineering                5          DegreeBranch           91.12
41         Engineering                6                   NaN           68.88
42    Customer Success               13          DegreeBranch           73.83
43    Customer Success               20         HighestDegree           70.85
44    Customer Success                4    CurrentCompanyType           88.65
45              Design               19          DegreeBranch           86.77
46         Engineering               15                   NaN           74.15
47         Engineering               10      YearsOfExperince           94.04
48    Customer Success               13          DegreeBranch           85.30
49              Design                6                   NaN           50.14

[50 rows x 22 columns]

In [ ]:
Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email
addresses in the format 'username@domain.com'. Write a Python function that creates a new column
'Username' in df that contains only the username part of each email address.

In [16]:
def extract_username(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

df=pd.DataFrame({
    'Emp_ID':[11041,15079,18638],
    'Email':['John.William123@gmail.com','James.Charles2345@yahoo.com','GeorgeFrank789@outlook.com']
})

df_username=extract_username(df)
df_username

   Emp_ID                        Email           Username
0   11041    John.William123@gmail.com    John.William123
1   15079  James.Charles2345@yahoo.com  James.Charles2345
2   18638   GeorgeFrank789@outlook.com     GeorgeFrank789

In [ ]:
Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects
all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The
function should return a new DataFrame that contains only the selected rows.

In [18]:
def abc(df):
    ans=df[(df['A']>5) & (df['B']<10)]
    return ans

df=pd.DataFrame({'A':[3,8,6,2,9],
                'B':[5,2,9,3,1],
                'C':[1,7,4,5,2]})

res=abc(df)
res

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

In [ ]:
Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean,
median, and standard deviation of the values in the 'Values' column.

In [21]:
def mms(df):
    mean=df['Values'].mean()
    median=df['Values'].median()
    std=df['Values'].std()
    
    print('Maen: ',mean)
    print('Median: ',median)
    print('Standard Deviation: ',std)
    
df=pd.DataFrame({'Values':[1,3,5,7,-4,23,-12,9,8]})
mms(df)

Maen:  4.444444444444445
Median:  5.0
Standard Deviation:  9.619136020338718

In [ ]:
Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to
create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days
for each row in the DataFrame. The moving average should be calculated using a window of size 7 and
should include the current day.

In [1]:
import pandas as pd

df = pd.DataFrame({
    'Date': pd.date_range(start='2023-06-01', periods=10),
    'Sales': [10, 15, 12, 18, 20, 22, 19, 25, 27, 30]
})

def calculate_moving_average(df):
    df['Date'] = pd.to_datetime(df['Date'])
    df = df.sort_values('Date')
    df['MovingAverage'] = df['Sales'].rolling(window=7, min_periods=1).mean()
    
    return df

print("Original DataFrame:")
print(df)

# Calculate and create the 'MovingAverage' column
df_with_moving_average = calculate_moving_average(df)

print("\nDataFrame with MovingAverage:")
print(df_with_moving_average)

Original DataFrame:
        Date  Sales
0 2023-06-01     10
1 2023-06-02     15
2 2023-06-03     12
3 2023-06-04     18
4 2023-06-05     20
5 2023-06-06     22
6 2023-06-07     19
7 2023-06-08     25
8 2023-06-09     27
9 2023-06-10     30

DataFrame with MovingAverage:
        Date  Sales  MovingAverage
0 2023-06-01     10      10.000000
1 2023-06-02     15      12.500000
2 2023-06-03     12      12.333333
3 2023-06-04     18      13.750000
4 2023-06-05     20      15.000000
5 2023-06-06     22      16.166667
6 2023-06-07     19      16.571429
7 2023-06-08     25      18.714286
8 2023-06-09     27      20.428571
9 2023-06-10     30      23.000000

In [ ]:
Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new
column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g.
Monday, Tuesday) corresponding to each date in the 'Date' column.

In [2]:
def add_weekday_column(df):
    
    df['Date'] = pd.to_datetime(df['Date'])

    df['Weekday'] = df['Date'].dt.strftime('%A')
    
    return df

df=pd.DataFrame({
    'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']
})

print(df)

df_with_weekday = add_weekday_column(df)

print(df_with_weekday)

         Date
0  2023-01-01
1  2023-01-02
2  2023-01-03
3  2023-01-04
4  2023-01-05
        Date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

In [ ]:
Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python
function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

In [2]:
import pandas as pd
def select_rows_between_dates(df):
    df['Date'] = pd.to_datetime(df['Date'])

    selected_rows = df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]
    
    return selected_rows

data = {'Date': ['2023-01-01', '2023-01-15', '2023-02-01', '2023-01-25', '2023-01-10']}
df = pd.DataFrame(data)

ans=select_rows_between_dates(df)
ans

        Date
0 2023-01-01
1 2023-01-15
3 2023-01-25
4 2023-01-10

In [ ]:
Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to
be imported?

In [ ]:
The first and foremost library that needs to be imported to use the basic functions of pandas is the pandas library itself. 
It provides the necessary data structures and functions for data manipulation and analysis.

To import the pandas library in Python, you can use the following import statement:

import pandas as pd


By convention, pd is used as an alias for the pandas library. This allows you to access the functions and classes provided by pandas using the 
pd prefix. For example, you can use pd.DataFrame() to create a DataFrame or pd.read_csv() to read data from a CSV file into a DataFrame.

Once you have imported the pandas library, you can start using its functions and data structures to work with tabular data efficiently.